ЕРПУХАстенд.cbr_Основной/src/DataProcessors/cbr_РеестрТМЦ/cbr_РеестрТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>cbr_РеестрТМЦ</name>
  <comment>//++ ШмелевР 02.02.2026 ЗКП.16</comment>
  <attributes>
    <name>ДатаЗаписиПлановойЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВключенияВДействующиеТехКарты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.cbr_Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяЧистаяЦена</name>
    <comment>не понятно что это</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиРасходовДляРасчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасчетов</name>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦенаТекущегоКварталаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияКрайняяЗакупка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДрайверЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортВЦенеЧистаЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СредняяЦенаОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ABCВРазререКатегории</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключенИндексВАктуальнуюТехКарту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДнейБезДвижения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.cbr_Статусы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЗаказахУПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВАктуальныхЗаказахУПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлавноваяЦенаБудущегоКвартала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СвободныйОстатокШТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АВС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаЦО</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/cbr_ПредопределенныеЗначенияКонстант/cbr_ПредопределенныеЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ПредопределенныеЗначенияКонстант</name>
  <comment>//cbr-larkovgeorg 15.02.2026 СКЛ.12(по указанию архитектора)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВалютаРубль</name>
      <description>Валюта рубль</description>
    </items>
    <items>
      <name>ВыходнойКонтроль</name>
      <description>Выходной контроль</description>
    </items>
    <items>
      <name>НаборУпаковокПаллеты</name>
      <description>Набор упаковок паллеты</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.НаборыУпаковок</types>
      <types>String</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/DataProcessors/cbr_РеестрТМЦ/Forms/Форма/Module.bsl
#Если Не ТолстыйКлиентУправляемоеПриложение И НЕ ТолстыйКлиентОбычноеПриложение  Тогда

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)		
	УсловияОтбора = Новый Структура();
	
	Если ЗначениеЗаполнено(Объект.ВидЦены) Тогда
		УсловияОтбора.Вставить("ВидЦены", Объект.ВидЦены);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураОтборы) Тогда
		УсловияОтбора.Вставить("Номенклатура", НоменклатураОтборы.ВыгрузитьЗначения());	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.cbr_ПрайсРеестраПродажТД.Форма", ПараметрыФормы,,Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументУстановкаЦен(Команда)
	СоздатьДокументУстановкаЦенНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАктуальноеХранилищеЗначений(ВидЦены)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены КАК ВидЦены,
		|	УстановкаЦенНоменклатурыВидыЦен.НастройкиКомпоновкиДанных КАК НастройкиКомпоновкиДанных,
		|	УстановкаЦенНоменклатурыВидыЦен.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатурыВидыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены = &ВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НастройкиКомпоновкиДанных;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура СоздатьДокументУстановкаЦенНаСервере()
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.ДатаЗаписиПлановойЦены);
	СтруктураПараметров.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	СтруктураПараметров.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыУстановокЦенНоменклатуры.Согласован"));
	СтруктураПараметров.Вставить("ВидЦены", Объект.ВидЦены);
	СтруктураПараметров.Вставить("НастройкиКомпоновкиДанных", ПолучитьАктуальноеХранилищеЗначений(Объект.ВидЦены));
	
	ТаблицаКЗаполнению = Объект.ТаблицаРасчетов.Выгрузить(,"Номенклатура, ХарактеристикаЦО, ВидЦены, ПлавноваяЦенаБудущегоКвартала");
	ТаблицаКЗаполнению.Очистить();
	ТаблицаКЗаполнению.Колонки.Добавить("ЦенаИзмененаВручную");
	ТаблицаКЗаполнению.Колонки.Добавить("Валюта");
	
	ВалютаЦены = ПредопределенноеЗначение("Справочник.cbr_ПредопределенныеЗначенияКонстант.ВалютаРубль");
	Если ЗначениеЗаполнено(ВалютаЦены) Тогда
		ВалютаЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаЦены, "Значение")
	Иначе
		ВызватьИсключение "Не установлено предопределенное значение";
	КонецЕсли;
	
	Для каждого ЭлементТЧ из Объект.ТаблицаРасчетов Цикл
		Если ЭлементТЧ.ПлавноваяЦенаБудущегоКвартала > 0 Тогда
			НоваяСтрока = ТаблицаКЗаполнению.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЧ);
			
			НоваяСтрока.ВидЦены = Объект.ВидЦены;
			НоваяСтрока.ЦенаИзмененаВручную = Истина;
			НоваяСтрока.Валюта = ВалютаЦены;
		КонецЕсли;
	КонецЦикла;
	СтруктураПараметров.Вставить("ТаблицаРасчетов", ТаблицаКЗаполнению);
	
	Обработки.cbr_РеестрТМЦ.СоздатьДокумент(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОтборов()
	Результат = Новый Структура; 
	
	ЭлементыОтборов = Новый Массив;	
	ЭлементыОтборов.Добавить("НоменклатураОтборы");
	ЭлементыОтборов.Добавить("Объект.ДатаЗаписиПлановойЦены");
	ЭлементыОтборов.Добавить("Объект.ПризнакВключенияВДействующиеТехКарты");
	ЭлементыОтборов.Добавить("Объект.Статус");
	ЭлементыОтборов.Добавить("Объект.ТранспортнаяЧистаяЦена");
	ЭлементыОтборов.Добавить("Объект.ВидЦены");
		
	Для каждого ИмяЭлементаКДобавлению из ЭлементыОтборов Цикл
		
		Если ЗначениеЗаполнено(СтрНайти(ИмяЭлементаКДобавлению,"Объект")) Тогда
			ИмяЭлементаДляПоиска = Прав(ИмяЭлементаКДобавлению, СтрДлина(ИмяЭлементаКДобавлению) - СтрНайти(ИмяЭлементаКДобавлению,"."));
			ТекущийЭлементКДобавлению = ЭтотОбъект["Объект"][ИмяЭлементаДляПоиска];
		Иначе
			ТекущийЭлементКДобавлению = ЭтотОбъект[ИмяЭлементаКДобавлению];
			ИмяЭлементаДляПоиска = ИмяЭлементаКДобавлению;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийЭлементКДобавлению) Тогда
			Результат.Вставить(ИмяЭлементаДляПоиска, ТекущийЭлементКДобавлению);
		Иначе
			Результат.Вставить(ИмяЭлементаДляПоиска, Неопределено);
		КонецЕсли;	
	КонецЦикла;
	
	Если Результат.Свойство("ДатаЗаписиПлановойЦены") Тогда
		Результат.Вставить("КонецПериода", Результат.ДатаЗаписиПлановойЦены);
		Результат.Вставить("НачалоПериода", НачалоМесяца(Результат.ДатаЗаписиПлановойЦены - 365 * 86400));
	КонецЕсли;
	
	Результат.Вставить("ТаблицаРасчетов", Объект.ТаблицаРасчетов.Выгрузить());
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	Объект.ТаблицаРасчетов.Очистить();
	
	ПараметрыЗапроса = ПолучитьПараметрыОтборов();	
		
	Обработки.cbr_РеестрТМЦ.ПолучениеДанныхКЗаполениюИзСКД(ПараметрыЗапроса);
	
	Объект.ТаблицаРасчетов.Загрузить(ПараметрыЗапроса.ТаблицаРасчетов);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
